Revit 2024 API
RepeaterCoordinates Methods
The RepeaterCoordinates type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetCoordinate
 Returns the coordinate in the given dimension.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
RepeaterCoordinates Class
Autodesk.Revit.DB Namespace